docs/testing/2026-09-07/database-load/database-c10.txt
pgbench (18.6)
transaction type: /tmp/scientific-search-read.sql
scaling factor: 1
query mode: prepared
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 863
number of failed transactions: 0 (0.000%)
latency average = 116.427 ms
initial connection time = 12.748 ms
tps = 85.890645 (without initial connection time)
statement latencies in milliseconds and failures:
       116.005           0 SELECT si.page_id, SUM(si.ranking) AS relevance