docs/testing/2026-09-07/database-load/database-c5.txt
pgbench (18.6)
transaction type: /tmp/scientific-search-read.sql
scaling factor: 1
query mode: prepared
number of clients: 5
number of threads: 5
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 799
number of failed transactions: 0 (0.000%)
latency average = 62.913 ms
initial connection time = 7.494 ms
tps = 79.474288 (without initial connection time)
statement latencies in milliseconds and failures:
        62.818           0 SELECT si.page_id, SUM(si.ranking) AS relevance